here is plan
```
# module.eks.module.eks_managed_node_group["three"].aws_eks_node_group.this[0] will be created
  + resource "aws_eks_node_group" "this" {
      + ami_type               = "CUSTOM"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "icmps-dev-2-k8s"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + labels                 = {
          + "node_groups" = "amd-gpu-based"
        }
      + node_group_name        = (known after apply)
      + node_group_name_prefix = "amd-gpu-group-"
      + node_role_arn          = "arn:aws:iam::xxxxxxxxxx:role/amd-gpu-group-eks-node-group-20250515001702528400000003"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-06fd2f1e5018c96e6",
          + "subnet-0fb6fff13e3521e43",
        ]
      + tags                   = {
          + "Name"                                                      = "amd-gpu-group"
          + "k8s"                                                       = "icmps-dev-2"
          + "k8s.io/cluster-autoscaler/enabled"                         = "true"
          + "k8s.io/cluster-autoscaler/icmps-dev-2-k8s"                 = "owned"
          + "k8s.io/cluster-autoscaler/node-template/label/node_groups" = "amd-gpu-based"
        }
      + tags_all               = {
          + "Name"                                                      = "amd-gpu-group"
          + "k8s"                                                       = "icmps-dev-2"
          + "k8s.io/cluster-autoscaler/enabled"                         = "true"
          + "k8s.io/cluster-autoscaler/icmps-dev-2-k8s"                 = "owned"
          + "k8s.io/cluster-autoscaler/node-template/label/node_groups" = "amd-gpu-based"
        }
      + version                = "1.31"

      + launch_template {
          + id      = "lt-0f017f3d5971b622b"
          + name    = (known after apply)
          + version = "$Latest"
        }

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 1
          + max_size     = 2
          + min_size     = 1
        }

      + timeouts {}

      + update_config {
          + max_unavailable_percentage = 10
        }
    }
```